exercise_app_api/app/controllers/exercises_controller.rb

  def create
    @exercise = Exercise.new(exercise_params)

    if @exercise.save
---
INSERT INTO "exercises" ("day", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["day", "Monday 07/31/2020"], ["description", "Maybe I do belong"], ["created_at", "2020-08-02 23:51:02.761101"], ["updated_at", "2020-08-02 23:51:02.761101"]]

  def update
    if @exercise.update(exercise_params)
---
UPDATE "exercises" SET "day" = $1, "description" = $2, "updated_at" = $3 WHERE "exercises"."id" = $4  [["day", "Funday"], ["description", "Funday"], ["updated_at", "2020-08-03 00:54:18.464513"], ["id", 3]]

  def destroy
    @exercise.destroy
---
DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 25]]

    def set_exercise
      @exercise = Exercise.find(params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]