exercise_app_api/app/controllers/goals_controller.rb

  def index
    @goals = Goal.all
---
SELECT "goals".* FROM "goals" WHERE "goals"."exercise_id" = $1  [["exercise_id", 2]]

  def create
    @goal = Goal.new(goal_params)
    @goal.exercise_id = params[:exercise_id]
    if @goal.save
---
INSERT INTO "goals" ("activity", "description", "created_at", "updated_at", "exercise_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["activity", "new activity"], ["description", "new activity description"], ["created_at", "2020-07-28 01:55:08.938760"], ["updated_at", "2020-07-28 01:55:08.938760"], ["exercise_id", 1]]

  def update
    if @goal.update(goal_params)
---
UPDATE "goals" SET "activity" = $1, "description" = $2, "updated_at" = $3 WHERE "goals"."id" = $4  [["activity", "new activity updated"], ["description", "new activity description updated"], ["updated_at", "2020-07-28 02:48:06.081046"], ["id", 24]]

  def destroy
    @goal.destroy
---
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 24]]

    def set_goal
      @goal = Goal.find(params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]